In [ ]:
# Grouping and Aggregating

In [7]:
import pandas as pd

WS_inventory = {'Workstation': ['WS1', 'WS2', 'WS2', 'WS1', 'WS1', 'WS19'], 'QTY': [85, 90, 87, 78, 88, 8]}
df = pd.DataFrame(WS_inventory)

In [8]:
df

  Workstation  QTY
0         WS1   85
1         WS2   90
2         WS2   87
3         WS1   78
4         WS1   88
5        WS19    8

In [3]:
# Groups data by unique WS name in WS_QC['Workstation']
df_grouped = df.groupby('Workstation')

In [4]:
df_grouped

In [5]:
# Aggregating QTY after Grouping by Workstation
sum_WS = df_grouped.agg({'QTY': 'mean'})

In [6]:
sum_WS

                   QTY
Workstation
WS1          83.666667
WS19          8.000000
WS2          88.500000

In [9]:
# group and Aggregate
average_WS = df.groupby('Workstation').agg({'QTY': 'mean'})

In [10]:
average_WS

                   QTY
Workstation
WS1          83.666667
WS19          8.000000
WS2          88.500000